Show / Hide Table of Contents
Class ConcreteSLSCheckResultCrackWidthEc2
SLS Check Crack width Ec2
Inheritance
System.Object
ConcreteCheckResultBase
ConcreteSLSCheckResultCrackWidth
ConcreteSLSCheckResultCrackWidthEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConcreteSLSCheckResultCrackWidthEc2 : ConcreteSLSCheckResultCrackWidth
Properties
Improve this Doc   View Source
My
Bending moment around y axis for quasi-permanent combination
Declaration
public double My { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Mz
Bending moment around z axis for quasi-permanent combination
Declaration
public double Mz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
N
Normal force for quasi-permanent combination
Declaration
public double N { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
W
calculated crack width value
Declaration
public double W { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Wlim
limiting crack width value
Declaration
public double Wlim { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source